Revit 2026 API
GeometryCreationUtilities Class
 A utility that allows construction of basic solid shapes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GeometryCreationUtilities
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class GeometryCreationUtilities
Public NotInheritable Class GeometryCreationUtilities
public ref class GeometryCreationUtilities abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type GeometryCreationUtilities = class end
The GeometryCreationUtilities type exposes the following members.
Methods
Name | Description
CreateBlendGeometry(CurveLoop, CurveLoop, ICollection<VertexPair>)
CreateBlendGeometry(CurveLoop, CurveLoop, ICollection<VertexPair>, SolidOptions)
CreateExtrusionGeometry(IList<CurveLoop>, XYZ, Double)
CreateExtrusionGeometry(IList<CurveLoop>, XYZ, Double, SolidOptions)
CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>, XYZ)
CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>, XYZ, SolidOptions)
CreateLoftGeometry
CreateRevolvedGeometry(Frame, IList<CurveLoop>, Double, Double)
CreateRevolvedGeometry(Frame, IList<CurveLoop>, Double, Double, SolidOptions)
CreateSweptBlendGeometry(Curve, IList<Double>, IList<CurveLoop>, IList<ICollection<VertexPair>>)
CreateSweptBlendGeometry(Curve, IList<Double>, IList<CurveLoop>, IList<ICollection<VertexPair>>, SolidOptions)
CreateSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>)
CreateSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>, SolidOptions)
Top
Remarks
 The shapes created by these utilities are not a part of any Revit document, but can be used in conjunction with other geometric utilities from within API applications.
See Also
Reference
Autodesk.Revit.DB Namespace